GopalSaraf/Practicals/PSDL/include/proc/pic16f18045.h
extern volatile PIR2bits_t PIR2bits __at(0x08E);
// bitfield macros
#define _PIR2_TMR4IF_POSN                                   0x0
#define _PIR2_TMR4IF_POSITION                               0x0
#define _PIR2_TMR4IF_SIZE                                   0x1
#define _PIR2_TMR4IF_LENGTH                                 0x1
#define _PIR2_TMR4IF_MASK                                   0x1
#define _PIR2_TMR6IF_POSN                                   0x1
#define _PIR2_TMR6IF_POSITION                               0x1
#define _PIR2_TMR6IF_SIZE                                   0x1
#define _PIR2_TMR6IF_LENGTH                                 0x1
#define _PIR2_TMR6IF_MASK                                   0x2
#define _PIR2_CCP1IF_POSN                                   0x2
#define _PIR2_CCP1IF_POSITION                               0x2
#define _PIR2_CCP1IF_SIZE                                   0x1
#define _PIR2_CCP1IF_LENGTH                                 0x1
#define _PIR2_CCP1IF_MASK                                   0x4
#define _PIR2_CCP2IF_POSN                                   0x3
#define _PIR2_CCP2IF_POSITION                               0x3
#define _PIR2_CCP2IF_SIZE                                   0x1
#define _PIR2_CCP2IF_LENGTH                                 0x1
#define _PIR2_CCP2IF_MASK                                   0x8
#define _PIR2_NCO1IF_POSN                                   0x4
#define _PIR2_NCO1IF_POSITION                               0x4
#define _PIR2_NCO1IF_SIZE                                   0x1
#define _PIR2_NCO1IF_LENGTH                                 0x1
#define _PIR2_NCO1IF_MASK                                   0x10
#define _PIR2_CWG1IF_POSN                                   0x5
#define _PIR2_CWG1IF_POSITION                               0x5
#define _PIR2_CWG1IF_SIZE                                   0x1
#define _PIR2_CWG1IF_LENGTH                                 0x1
#define _PIR2_CWG1IF_MASK                                   0x20
#define _PIR2_CLC1IF_POSN                                   0x6
#define _PIR2_CLC1IF_POSITION                               0x6
#define _PIR2_CLC1IF_SIZE                                   0x1
#define _PIR2_CLC1IF_LENGTH                                 0x1
#define _PIR2_CLC1IF_MASK                                   0x40
#define _PIR2_CLC2IF_POSN                                   0x7
#define _PIR2_CLC2IF_POSITION                               0x7
#define _PIR2_CLC2IF_SIZE                                   0x1
#define _PIR2_CLC2IF_LENGTH                                 0x1
#define _PIR2_CLC2IF_MASK                                   0x80

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x08F);
#ifndef _LIB_BUILD
asm("PIR3 equ 08Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLC3IF                 :1;
        unsigned CLC4IF                 :1;
        unsigned TX1IF                  :1;
        unsigned RC1IF                  :1;
        unsigned TX2IF                  :1;
        unsigned RC2IF                  :1;
        unsigned SSP1IF                 :1;
        unsigned BCL1IF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0x08F);
// bitfield macros
#define _PIR3_CLC3IF_POSN                                   0x0
#define _PIR3_CLC3IF_POSITION                               0x0
#define _PIR3_CLC3IF_SIZE                                   0x1
#define _PIR3_CLC3IF_LENGTH                                 0x1
#define _PIR3_CLC3IF_MASK                                   0x1
#define _PIR3_CLC4IF_POSN                                   0x1
#define _PIR3_CLC4IF_POSITION                               0x1
#define _PIR3_CLC4IF_SIZE                                   0x1
#define _PIR3_CLC4IF_LENGTH                                 0x1
#define _PIR3_CLC4IF_MASK                                   0x2
#define _PIR3_TX1IF_POSN                                    0x2
#define _PIR3_TX1IF_POSITION                                0x2
#define _PIR3_TX1IF_SIZE                                    0x1
#define _PIR3_TX1IF_LENGTH                                  0x1
#define _PIR3_TX1IF_MASK                                    0x4
#define _PIR3_RC1IF_POSN                                    0x3
#define _PIR3_RC1IF_POSITION                                0x3
#define _PIR3_RC1IF_SIZE                                    0x1
#define _PIR3_RC1IF_LENGTH                                  0x1
#define _PIR3_RC1IF_MASK                                    0x8
#define _PIR3_TX2IF_POSN                                    0x4
#define _PIR3_TX2IF_POSITION                                0x4
#define _PIR3_TX2IF_SIZE                                    0x1
#define _PIR3_TX2IF_LENGTH                                  0x1
#define _PIR3_TX2IF_MASK                                    0x10
#define _PIR3_RC2IF_POSN                                    0x5
#define _PIR3_RC2IF_POSITION                                0x5
#define _PIR3_RC2IF_SIZE                                    0x1
#define _PIR3_RC2IF_LENGTH                                  0x1
#define _PIR3_RC2IF_MASK                                    0x20
#define _PIR3_SSP1IF_POSN                                   0x6
#define _PIR3_SSP1IF_POSITION                               0x6
#define _PIR3_SSP1IF_SIZE                                   0x1
#define _PIR3_SSP1IF_LENGTH                                 0x1
#define _PIR3_SSP1IF_MASK                                   0x40
#define _PIR3_BCL1IF_POSN                                   0x7
#define _PIR3_BCL1IF_POSITION                               0x7
#define _PIR3_BCL1IF_SIZE                                   0x1
#define _PIR3_BCL1IF_LENGTH                                 0x1
#define _PIR3_BCL1IF_MASK                                   0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x090);
#ifndef _LIB_BUILD
asm("PIR4 equ 090h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2IF                 :1;
        unsigned BCL2IF                 :1;
        unsigned CM1IF                  :1;
        unsigned ADIF                   :1;
        unsigned ADTIF                  :1;
        unsigned ZCDIF                  :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x090);
// bitfield macros
#define _PIR4_SSP2IF_POSN                                   0x0
#define _PIR4_SSP2IF_POSITION                               0x0
#define _PIR4_SSP2IF_SIZE                                   0x1
#define _PIR4_SSP2IF_LENGTH                                 0x1
#define _PIR4_SSP2IF_MASK                                   0x1
#define _PIR4_BCL2IF_POSN                                   0x1
#define _PIR4_BCL2IF_POSITION                               0x1
#define _PIR4_BCL2IF_SIZE                                   0x1
#define _PIR4_BCL2IF_LENGTH                                 0x1
#define _PIR4_BCL2IF_MASK                                   0x2
#define _PIR4_CM1IF_POSN                                    0x2
#define _PIR4_CM1IF_POSITION                                0x2
#define _PIR4_CM1IF_SIZE                                    0x1
#define _PIR4_CM1IF_LENGTH                                  0x1
#define _PIR4_CM1IF_MASK                                    0x4
#define _PIR4_ADIF_POSN                                     0x3
#define _PIR4_ADIF_POSITION                                 0x3
#define _PIR4_ADIF_SIZE                                     0x1
#define _PIR4_ADIF_LENGTH                                   0x1
#define _PIR4_ADIF_MASK                                     0x8
#define _PIR4_ADTIF_POSN                                    0x4
#define _PIR4_ADTIF_POSITION                                0x4
#define _PIR4_ADTIF_SIZE                                    0x1
#define _PIR4_ADTIF_LENGTH                                  0x1
#define _PIR4_ADTIF_MASK                                    0x10
#define _PIR4_ZCDIF_POSN                                    0x5
#define _PIR4_ZCDIF_POSITION                                0x5
#define _PIR4_ZCDIF_SIZE                                    0x1
#define _PIR4_ZCDIF_LENGTH                                  0x1
#define _PIR4_ZCDIF_MASK                                    0x20

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0x096);
#ifndef _LIB_BUILD
asm("PIE0 equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTE                   :1;
        unsigned                        :3;
        unsigned IOCIE                  :1;
        unsigned TMR0IE                 :1;
    };
} PIE0bits_t;
