GopalSaraf/Practicals/PSDL/include/proc/pic16f18045.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0x09A);
#ifndef _LIB_BUILD
asm("PIE4 equ 09Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2IE                 :1;
        unsigned BCL2IE                 :1;
        unsigned CM1IE                  :1;
        unsigned ADIE                   :1;
        unsigned ADTIE                  :1;
        unsigned ZCDIE                  :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0x09A);
// bitfield macros
#define _PIE4_SSP2IE_POSN                                   0x0
#define _PIE4_SSP2IE_POSITION                               0x0
#define _PIE4_SSP2IE_SIZE                                   0x1
#define _PIE4_SSP2IE_LENGTH                                 0x1
#define _PIE4_SSP2IE_MASK                                   0x1
#define _PIE4_BCL2IE_POSN                                   0x1
#define _PIE4_BCL2IE_POSITION                               0x1
#define _PIE4_BCL2IE_SIZE                                   0x1
#define _PIE4_BCL2IE_LENGTH                                 0x1
#define _PIE4_BCL2IE_MASK                                   0x2
#define _PIE4_CM1IE_POSN                                    0x2
#define _PIE4_CM1IE_POSITION                                0x2
#define _PIE4_CM1IE_SIZE                                    0x1
#define _PIE4_CM1IE_LENGTH                                  0x1
#define _PIE4_CM1IE_MASK                                    0x4
#define _PIE4_ADIE_POSN                                     0x3
#define _PIE4_ADIE_POSITION                                 0x3
#define _PIE4_ADIE_SIZE                                     0x1
#define _PIE4_ADIE_LENGTH                                   0x1
#define _PIE4_ADIE_MASK                                     0x8
#define _PIE4_ADTIE_POSN                                    0x4
#define _PIE4_ADTIE_POSITION                                0x4
#define _PIE4_ADTIE_SIZE                                    0x1
#define _PIE4_ADTIE_LENGTH                                  0x1
#define _PIE4_ADTIE_MASK                                    0x10
#define _PIE4_ZCDIE_POSN                                    0x5
#define _PIE4_ZCDIE_POSITION                                0x5
#define _PIE4_ZCDIE_SIZE                                    0x1
#define _PIE4_ZCDIE_LENGTH                                  0x1
#define _PIE4_ZCDIE_MASK                                    0x20

// Register: WDTCON
#define WDTCON WDTCON
extern volatile unsigned char           WDTCON              __at(0x18C);
#ifndef _LIB_BUILD
asm("WDTCON equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEN                    :1;
        unsigned PS                     :5;
        unsigned                        :1;
        unsigned CS                     :1;
    };
    struct {
        unsigned                        :1;
        unsigned PS0                    :1;
        unsigned PS1                    :1;
        unsigned PS2                    :1;
        unsigned PS3                    :1;
        unsigned PS4                    :1;
    };
    struct {
        unsigned SWDTEN                 :1;
        unsigned WDTPS0                 :1;
        unsigned WDTPS1                 :1;
        unsigned WDTPS2                 :1;
        unsigned WDTPS3                 :1;
        unsigned WDTPS4                 :1;
        unsigned                        :1;
        unsigned WDTCS                  :1;
    };
} WDTCONbits_t;
extern volatile WDTCONbits_t WDTCONbits __at(0x18C);
// bitfield macros
#define _WDTCON_SEN_POSN                                    0x0
#define _WDTCON_SEN_POSITION                                0x0
#define _WDTCON_SEN_SIZE                                    0x1
#define _WDTCON_SEN_LENGTH                                  0x1
#define _WDTCON_SEN_MASK                                    0x1
#define _WDTCON_PS_POSN                                     0x1
#define _WDTCON_PS_POSITION                                 0x1
#define _WDTCON_PS_SIZE                                     0x5
#define _WDTCON_PS_LENGTH                                   0x5
#define _WDTCON_PS_MASK                                     0x3E
#define _WDTCON_CS_POSN                                     0x7
#define _WDTCON_CS_POSITION                                 0x7
#define _WDTCON_CS_SIZE                                     0x1
#define _WDTCON_CS_LENGTH                                   0x1
#define _WDTCON_CS_MASK                                     0x80
#define _WDTCON_PS0_POSN                                    0x1
#define _WDTCON_PS0_POSITION                                0x1
#define _WDTCON_PS0_SIZE                                    0x1
#define _WDTCON_PS0_LENGTH                                  0x1
#define _WDTCON_PS0_MASK                                    0x2
#define _WDTCON_PS1_POSN                                    0x2
#define _WDTCON_PS1_POSITION                                0x2
#define _WDTCON_PS1_SIZE                                    0x1
#define _WDTCON_PS1_LENGTH                                  0x1
#define _WDTCON_PS1_MASK                                    0x4
#define _WDTCON_PS2_POSN                                    0x3
#define _WDTCON_PS2_POSITION                                0x3
#define _WDTCON_PS2_SIZE                                    0x1
#define _WDTCON_PS2_LENGTH                                  0x1
#define _WDTCON_PS2_MASK                                    0x8
#define _WDTCON_PS3_POSN                                    0x4
#define _WDTCON_PS3_POSITION                                0x4
#define _WDTCON_PS3_SIZE                                    0x1
#define _WDTCON_PS3_LENGTH                                  0x1
#define _WDTCON_PS3_MASK                                    0x10
#define _WDTCON_PS4_POSN                                    0x5
#define _WDTCON_PS4_POSITION                                0x5
#define _WDTCON_PS4_SIZE                                    0x1
#define _WDTCON_PS4_LENGTH                                  0x1
#define _WDTCON_PS4_MASK                                    0x20
#define _WDTCON_SWDTEN_POSN                                 0x0
#define _WDTCON_SWDTEN_POSITION                             0x0
#define _WDTCON_SWDTEN_SIZE                                 0x1
#define _WDTCON_SWDTEN_LENGTH                               0x1
#define _WDTCON_SWDTEN_MASK                                 0x1
#define _WDTCON_WDTPS0_POSN                                 0x1
#define _WDTCON_WDTPS0_POSITION                             0x1
#define _WDTCON_WDTPS0_SIZE                                 0x1
#define _WDTCON_WDTPS0_LENGTH                               0x1
#define _WDTCON_WDTPS0_MASK                                 0x2
#define _WDTCON_WDTPS1_POSN                                 0x2
#define _WDTCON_WDTPS1_POSITION                             0x2
#define _WDTCON_WDTPS1_SIZE                                 0x1
#define _WDTCON_WDTPS1_LENGTH                               0x1
#define _WDTCON_WDTPS1_MASK                                 0x4
#define _WDTCON_WDTPS2_POSN                                 0x3
#define _WDTCON_WDTPS2_POSITION                             0x3
#define _WDTCON_WDTPS2_SIZE                                 0x1
#define _WDTCON_WDTPS2_LENGTH                               0x1
#define _WDTCON_WDTPS2_MASK                                 0x8
#define _WDTCON_WDTPS3_POSN                                 0x4
#define _WDTCON_WDTPS3_POSITION                             0x4
#define _WDTCON_WDTPS3_SIZE                                 0x1
#define _WDTCON_WDTPS3_LENGTH                               0x1
#define _WDTCON_WDTPS3_MASK                                 0x10
#define _WDTCON_WDTPS4_POSN                                 0x5
#define _WDTCON_WDTPS4_POSITION                             0x5
#define _WDTCON_WDTPS4_SIZE                                 0x1
#define _WDTCON_WDTPS4_LENGTH                               0x1
#define _WDTCON_WDTPS4_MASK                                 0x20
#define _WDTCON_WDTCS_POSN                                  0x7
#define _WDTCON_WDTCS_POSITION                              0x7
#define _WDTCON_WDTCS_SIZE                                  0x1
#define _WDTCON_WDTCS_LENGTH                                0x1
#define _WDTCON_WDTCS_MASK                                  0x80

// Register: BORCON
#define BORCON BORCON
extern volatile unsigned char           BORCON              __at(0x18D);
#ifndef _LIB_BUILD
asm("BORCON equ 018Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BORRDY                 :1;
        unsigned                        :6;
        unsigned SBOREN                 :1;
    };
} BORCONbits_t;
extern volatile BORCONbits_t BORCONbits __at(0x18D);
// bitfield macros
#define _BORCON_BORRDY_POSN                                 0x0
#define _BORCON_BORRDY_POSITION                             0x0
#define _BORCON_BORRDY_SIZE                                 0x1
#define _BORCON_BORRDY_LENGTH                               0x1
#define _BORCON_BORRDY_MASK                                 0x1
#define _BORCON_SBOREN_POSN                                 0x7
#define _BORCON_SBOREN_POSITION                             0x7
#define _BORCON_SBOREN_SIZE                                 0x1
#define _BORCON_SBOREN_LENGTH                               0x1
#define _BORCON_SBOREN_MASK                                 0x80

// Register: PCON0
#define PCON0 PCON0
extern volatile unsigned char           PCON0               __at(0x18E);
#ifndef _LIB_BUILD
asm("PCON0 equ 018Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned nBOR                   :1;
        unsigned nPOR                   :1;
        unsigned nRI                    :1;
        unsigned nRMCLR                 :1;
        unsigned nRWDT                  :1;
        unsigned                        :1;
        unsigned STKUNF                 :1;
        unsigned STKOVF                 :1;
    };
} PCON0bits_t;
extern volatile PCON0bits_t PCON0bits __at(0x18E);
// bitfield macros
#define _PCON0_nBOR_POSN                                    0x0
#define _PCON0_nBOR_POSITION                                0x0
#define _PCON0_nBOR_SIZE                                    0x1
#define _PCON0_nBOR_LENGTH                                  0x1
#define _PCON0_nBOR_MASK                                    0x1
#define _PCON0_nPOR_POSN                                    0x1
#define _PCON0_nPOR_POSITION                                0x1
#define _PCON0_nPOR_SIZE                                    0x1
#define _PCON0_nPOR_LENGTH                                  0x1
#define _PCON0_nPOR_MASK                                    0x2
#define _PCON0_nRI_POSN                                     0x2
#define _PCON0_nRI_POSITION                                 0x2
#define _PCON0_nRI_SIZE                                     0x1
#define _PCON0_nRI_LENGTH                                   0x1
#define _PCON0_nRI_MASK                                     0x4
#define _PCON0_nRMCLR_POSN                                  0x3
#define _PCON0_nRMCLR_POSITION                              0x3
#define _PCON0_nRMCLR_SIZE                                  0x1
#define _PCON0_nRMCLR_LENGTH                                0x1
#define _PCON0_nRMCLR_MASK                                  0x8
#define _PCON0_nRWDT_POSN                                   0x4
#define _PCON0_nRWDT_POSITION                               0x4
#define _PCON0_nRWDT_SIZE                                   0x1
#define _PCON0_nRWDT_LENGTH                                 0x1
#define _PCON0_nRWDT_MASK                                   0x10
#define _PCON0_STKUNF_POSN                                  0x6
#define _PCON0_STKUNF_POSITION                              0x6
#define _PCON0_STKUNF_SIZE                                  0x1
#define _PCON0_STKUNF_LENGTH                                0x1
#define _PCON0_STKUNF_MASK                                  0x40
#define _PCON0_STKOVF_POSN                                  0x7
#define _PCON0_STKOVF_POSITION                              0x7
#define _PCON0_STKOVF_SIZE                                  0x1
#define _PCON0_STKOVF_LENGTH                                0x1
#define _PCON0_STKOVF_MASK                                  0x80

// Register: PCON1
#define PCON1 PCON1
extern volatile unsigned char           PCON1               __at(0x18F);
#ifndef _LIB_BUILD
asm("PCON1 equ 018Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned nMEMV                  :1;
    };
} PCON1bits_t;
extern volatile PCON1bits_t PCON1bits __at(0x18F);
// bitfield macros
#define _PCON1_nMEMV_POSN                                   0x1
#define _PCON1_nMEMV_POSITION                               0x1
#define _PCON1_nMEMV_SIZE                                   0x1
#define _PCON1_nMEMV_LENGTH                                 0x1
#define _PCON1_nMEMV_MASK                                   0x2

// Register: TMR0L
#define TMR0L TMR0L
extern volatile unsigned char           TMR0L               __at(0x19C);
#ifndef _LIB_BUILD
asm("TMR0L equ 019Ch");
#endif
// aliases
extern volatile unsigned char           TMR0                __at(0x19C);
#ifndef _LIB_BUILD
asm("TMR0 equ 019Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0L                  :8;
    };
    struct {
        unsigned TMR0L0                 :1;
        unsigned TMR0L1                 :1;
        unsigned TMR0L2                 :1;
        unsigned TMR0L3                 :1;
        unsigned TMR0L4                 :1;
        unsigned TMR0L5                 :1;
        unsigned TMR0L6                 :1;
        unsigned TMR0L7                 :1;
    };
} TMR0Lbits_t;
extern volatile TMR0Lbits_t TMR0Lbits __at(0x19C);
// bitfield macros
#define _TMR0L_TMR0L_POSN                                   0x0
#define _TMR0L_TMR0L_POSITION                               0x0
#define _TMR0L_TMR0L_SIZE                                   0x8
#define _TMR0L_TMR0L_LENGTH                                 0x8
#define _TMR0L_TMR0L_MASK                                   0xFF
#define _TMR0L_TMR0L0_POSN                                  0x0
#define _TMR0L_TMR0L0_POSITION                              0x0
#define _TMR0L_TMR0L0_SIZE                                  0x1
#define _TMR0L_TMR0L0_LENGTH                                0x1
#define _TMR0L_TMR0L0_MASK                                  0x1
#define _TMR0L_TMR0L1_POSN                                  0x1
#define _TMR0L_TMR0L1_POSITION                              0x1
#define _TMR0L_TMR0L1_SIZE                                  0x1
#define _TMR0L_TMR0L1_LENGTH                                0x1
#define _TMR0L_TMR0L1_MASK                                  0x2
#define _TMR0L_TMR0L2_POSN                                  0x2
#define _TMR0L_TMR0L2_POSITION                              0x2
#define _TMR0L_TMR0L2_SIZE                                  0x1
#define _TMR0L_TMR0L2_LENGTH                                0x1
#define _TMR0L_TMR0L2_MASK                                  0x4
#define _TMR0L_TMR0L3_POSN                                  0x3
#define _TMR0L_TMR0L3_POSITION                              0x3
#define _TMR0L_TMR0L3_SIZE                                  0x1
#define _TMR0L_TMR0L3_LENGTH                                0x1
#define _TMR0L_TMR0L3_MASK                                  0x8
#define _TMR0L_TMR0L4_POSN                                  0x4
#define _TMR0L_TMR0L4_POSITION                              0x4
#define _TMR0L_TMR0L4_SIZE                                  0x1
#define _TMR0L_TMR0L4_LENGTH                                0x1
#define _TMR0L_TMR0L4_MASK                                  0x10
#define _TMR0L_TMR0L5_POSN                                  0x5
#define _TMR0L_TMR0L5_POSITION                              0x5
#define _TMR0L_TMR0L5_SIZE                                  0x1
#define _TMR0L_TMR0L5_LENGTH                                0x1
#define _TMR0L_TMR0L5_MASK                                  0x20
#define _TMR0L_TMR0L6_POSN                                  0x6
#define _TMR0L_TMR0L6_POSITION                              0x6
#define _TMR0L_TMR0L6_SIZE                                  0x1
#define _TMR0L_TMR0L6_LENGTH                                0x1
#define _TMR0L_TMR0L6_MASK                                  0x40
#define _TMR0L_TMR0L7_POSN                                  0x7
#define _TMR0L_TMR0L7_POSITION                              0x7
#define _TMR0L_TMR0L7_SIZE                                  0x1
#define _TMR0L_TMR0L7_LENGTH                                0x1
#define _TMR0L_TMR0L7_MASK                                  0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TMR0L                  :8;
    };
    struct {
        unsigned TMR0L0                 :1;
        unsigned TMR0L1                 :1;
        unsigned TMR0L2                 :1;
        unsigned TMR0L3                 :1;
        unsigned TMR0L4                 :1;
        unsigned TMR0L5                 :1;
        unsigned TMR0L6                 :1;
        unsigned TMR0L7                 :1;
    };
} TMR0bits_t;
