GopalSaraf/Practicals/PSDL/include/proc/pic16f18045.h
extern volatile CLCIN2PPSbits_t CLCIN2PPSbits __at(0x1E3F);
// bitfield macros
#define _CLCIN2PPS_CLCIN2PPS_POSN                           0x0
#define _CLCIN2PPS_CLCIN2PPS_POSITION                       0x0
#define _CLCIN2PPS_CLCIN2PPS_SIZE                           0x5
#define _CLCIN2PPS_CLCIN2PPS_LENGTH                         0x5
#define _CLCIN2PPS_CLCIN2PPS_MASK                           0x1F
#define _CLCIN2PPS_CLCIN2PPS0_POSN                          0x0
#define _CLCIN2PPS_CLCIN2PPS0_POSITION                      0x0
#define _CLCIN2PPS_CLCIN2PPS0_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS0_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS0_MASK                          0x1
#define _CLCIN2PPS_CLCIN2PPS1_POSN                          0x1
#define _CLCIN2PPS_CLCIN2PPS1_POSITION                      0x1
#define _CLCIN2PPS_CLCIN2PPS1_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS1_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS1_MASK                          0x2
#define _CLCIN2PPS_CLCIN2PPS2_POSN                          0x2
#define _CLCIN2PPS_CLCIN2PPS2_POSITION                      0x2
#define _CLCIN2PPS_CLCIN2PPS2_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS2_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS2_MASK                          0x4
#define _CLCIN2PPS_CLCIN2PPS3_POSN                          0x3
#define _CLCIN2PPS_CLCIN2PPS3_POSITION                      0x3
#define _CLCIN2PPS_CLCIN2PPS3_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS3_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS3_MASK                          0x8
#define _CLCIN2PPS_CLCIN2PPS4_POSN                          0x4
#define _CLCIN2PPS_CLCIN2PPS4_POSITION                      0x4
#define _CLCIN2PPS_CLCIN2PPS4_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS4_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS4_MASK                          0x10

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
extern volatile unsigned char           CLCIN3PPS           __at(0x1E40);
#ifndef _LIB_BUILD
asm("CLCIN3PPS equ 01E40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN3PPS              :5;
    };
    struct {
        unsigned CLCIN3PPS0             :1;
        unsigned CLCIN3PPS1             :1;
        unsigned CLCIN3PPS2             :1;
        unsigned CLCIN3PPS3             :1;
        unsigned CLCIN3PPS4             :1;
    };
} CLCIN3PPSbits_t;
extern volatile CLCIN3PPSbits_t CLCIN3PPSbits __at(0x1E40);
// bitfield macros
#define _CLCIN3PPS_CLCIN3PPS_POSN                           0x0
#define _CLCIN3PPS_CLCIN3PPS_POSITION                       0x0
#define _CLCIN3PPS_CLCIN3PPS_SIZE                           0x5
#define _CLCIN3PPS_CLCIN3PPS_LENGTH                         0x5
#define _CLCIN3PPS_CLCIN3PPS_MASK                           0x1F
#define _CLCIN3PPS_CLCIN3PPS0_POSN                          0x0
#define _CLCIN3PPS_CLCIN3PPS0_POSITION                      0x0
#define _CLCIN3PPS_CLCIN3PPS0_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS0_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS0_MASK                          0x1
#define _CLCIN3PPS_CLCIN3PPS1_POSN                          0x1
#define _CLCIN3PPS_CLCIN3PPS1_POSITION                      0x1
#define _CLCIN3PPS_CLCIN3PPS1_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS1_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS1_MASK                          0x2
#define _CLCIN3PPS_CLCIN3PPS2_POSN                          0x2
#define _CLCIN3PPS_CLCIN3PPS2_POSITION                      0x2
#define _CLCIN3PPS_CLCIN3PPS2_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS2_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS2_MASK                          0x4
#define _CLCIN3PPS_CLCIN3PPS3_POSN                          0x3
#define _CLCIN3PPS_CLCIN3PPS3_POSITION                      0x3
#define _CLCIN3PPS_CLCIN3PPS3_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS3_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS3_MASK                          0x8
#define _CLCIN3PPS_CLCIN3PPS4_POSN                          0x4
#define _CLCIN3PPS_CLCIN3PPS4_POSITION                      0x4
#define _CLCIN3PPS_CLCIN3PPS4_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS4_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS4_MASK                          0x10

// Register: RX1PPS
#define RX1PPS RX1PPS
extern volatile unsigned char           RX1PPS              __at(0x1E41);
#ifndef _LIB_BUILD
asm("RX1PPS equ 01E41h");
#endif
// aliases
extern volatile unsigned char           RX1DTPPS            __at(0x1E41);
#ifndef _LIB_BUILD
asm("RX1DTPPS equ 01E41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX1PPS                 :5;
    };
} RX1PPSbits_t;
extern volatile RX1PPSbits_t RX1PPSbits __at(0x1E41);
// bitfield macros
#define _RX1PPS_RX1PPS_POSN                                 0x0
#define _RX1PPS_RX1PPS_POSITION                             0x0
#define _RX1PPS_RX1PPS_SIZE                                 0x5
#define _RX1PPS_RX1PPS_LENGTH                               0x5
#define _RX1PPS_RX1PPS_MASK                                 0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned RX1PPS                 :5;
    };
} RX1DTPPSbits_t;
extern volatile RX1DTPPSbits_t RX1DTPPSbits __at(0x1E41);
// bitfield macros
#define _RX1DTPPS_RX1PPS_POSN                               0x0
#define _RX1DTPPS_RX1PPS_POSITION                           0x0
#define _RX1DTPPS_RX1PPS_SIZE                               0x5
#define _RX1DTPPS_RX1PPS_LENGTH                             0x5
#define _RX1DTPPS_RX1PPS_MASK                               0x1F

// Register: CK1PPS
#define CK1PPS CK1PPS
extern volatile unsigned char           CK1PPS              __at(0x1E42);
#ifndef _LIB_BUILD
asm("CK1PPS equ 01E42h");
#endif
// aliases
extern volatile unsigned char           TX1CKPPS            __at(0x1E42);
#ifndef _LIB_BUILD
asm("TX1CKPPS equ 01E42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CK1PPS                 :5;
    };
} CK1PPSbits_t;
extern volatile CK1PPSbits_t CK1PPSbits __at(0x1E42);
// bitfield macros
#define _CK1PPS_CK1PPS_POSN                                 0x0
#define _CK1PPS_CK1PPS_POSITION                             0x0
#define _CK1PPS_CK1PPS_SIZE                                 0x5
#define _CK1PPS_CK1PPS_LENGTH                               0x5
#define _CK1PPS_CK1PPS_MASK                                 0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned CK1PPS                 :5;
    };
} TX1CKPPSbits_t;
extern volatile TX1CKPPSbits_t TX1CKPPSbits __at(0x1E42);
// bitfield macros
#define _TX1CKPPS_CK1PPS_POSN                               0x0
#define _TX1CKPPS_CK1PPS_POSITION                           0x0
#define _TX1CKPPS_CK1PPS_SIZE                               0x5
#define _TX1CKPPS_CK1PPS_LENGTH                             0x5
#define _TX1CKPPS_CK1PPS_MASK                               0x1F

// Register: RX2PPS
#define RX2PPS RX2PPS
extern volatile unsigned char           RX2PPS              __at(0x1E43);
#ifndef _LIB_BUILD
asm("RX2PPS equ 01E43h");
#endif
// aliases
extern volatile unsigned char           RX2DTPPS            __at(0x1E43);
#ifndef _LIB_BUILD
asm("RX2DTPPS equ 01E43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX2PPS                 :5;
    };
} RX2PPSbits_t;
extern volatile RX2PPSbits_t RX2PPSbits __at(0x1E43);
// bitfield macros
#define _RX2PPS_RX2PPS_POSN                                 0x0
#define _RX2PPS_RX2PPS_POSITION                             0x0
#define _RX2PPS_RX2PPS_SIZE                                 0x5
#define _RX2PPS_RX2PPS_LENGTH                               0x5
#define _RX2PPS_RX2PPS_MASK                                 0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned RX2PPS                 :5;
    };
} RX2DTPPSbits_t;
